services/lms/app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    if @course.save
---
INSERT INTO "courses" ("title", "description", "created_at", "updated_at") VALUES ('BigBoss 1', 'This is description 1', '2025-11-03 17:56:45.483178', '2025-11-03 17:56:45.483178') RETURNING "id"

    def set_course
      begin
        @course = Course.find(params.expect(:id))
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = '71d04e91-1a1e-4404-a1de-012becb7259e' LIMIT 1

    def course_with_lessons_and_completion(course)
      total_lessons = course.lessons.count
      user_id = params[:user_id] || current_user.id
      completion_percentage = 0

      if user_id.present? && total_lessons > 0
        completed_lessons_count = UserLessonCompletion.where(
          user_id: user_id,
          course_id: course.id
        ).count
---
SELECT COUNT(*) FROM "lessons" WHERE "lessons"."course_id" = '71d04e91-1a1e-4404-a1de-012becb7259e'
SELECT COUNT(*) FROM "user_lesson_completions" WHERE "user_lesson_completions"."user_id" = '0ee1c2cc-13fb-418b-a7b5-1d9baf25a334' AND "user_lesson_completions"."course_id" = '223a0d98-ef34-43b3-896f-0b593cd73894'