services/lms/app/controllers/lessons_controller.rb

INSERT INTO "lessons" ("lesson_name", "lesson_description", "course_id", "created_at", "updated_at") VALUES ('Lesson Name 1', 'Lesson Description 1', '71d04e91-1a1e-4404-a1de-012becb7259e', '2025-11-03 18:05:03.190934', '2025-11-03 18:05:03.190934') RETURNING "id"
---
  def create
    @lesson = @course.lessons.new(lesson_params)

    if @lesson.save

UPDATE "lessons" SET "updated_at" = '2025-11-03 18:20:37.975538', "completed" = TRUE WHERE "lessons"."id" = '2c7e3640-e52a-49a7-86fd-53d7fcea459f'
---
  def update
    if @lesson.update(lesson_params)

SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = '2c7e3640-e52a-49a7-86fd-53d7fcea459f' LIMIT 1
INSERT INTO "user_lesson_completions" ("user_id", "course_id", "lesson_id", "completed_at", "is_completed", "created_at", "updated_at") VALUES ('0ee1c2cc-13fb-418b-a7b5-1d9baf25a334', '223a0d98-ef34-43b3-896f-0b593cd73894', '2494b34c-86dd-4490-8d40-a7fda10acc4c', '2025-11-03 20:45:37.564891', TRUE, '2025-11-03 20:45:37.582946', '2025-11-03 20:45:37.582946') RETURNING "id"
---
  def mark_complete
    lesson = Lesson.find_by_id(params.expect(:id))
    render json: {message: "Lesson Not Found"}, status: :not_found and return if lesson.nil?
    user_lesson_completion = current_user
                              .user_lesson_completions.new(course_id: lesson.course_id,
                                                           lesson_id: lesson.id,
                                                           completed_at: Time.now,
                                                           is_completed: true)
    if user_lesson_completion.save

SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = '71d04e91-1a1e-4404-a1de-012becb7259e'
---
    def set_lesson
      begin
        @lesson = @course.lessons.find(params.expect(:id))

SELECT "courses".* FROM "courses" WHERE "courses"."id" = '71d04e91-1a1e-4404-a1de-012becb7259e' LIMIT 1
---
    def set_course
      begin
        @course = Course.find(params.expect(:course_id))