services/lms/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = '0ee1c2cc-13fb-418b-a7b5-1d9baf25a334' LIMIT 1
---
    def set_user
        begin
            @user = User.find(params.expect(:user_id))